{"podcast_details": {"podcast_title": "WSJ What’s News", "episode_title": "Mortgage Rates Top 7%", "episode_image": "https://megaphone.imgix.net/podcasts/7297a16a-9f81-11e5-8821-232b0d194322/image/whats_news_new_logo.jpeg?ixlib=rails-4.3.1&max-w=3000&max-h=3000&fit=crop&auto=format,compress", "episode_transcript": " Amazon Business presents the life of a procurement manager. Delivery. Nonprofit work takes you out of the office, but that shouldn't mean delayed deliveries. Looks like we missed today's shipment. Deliveries that work for you. That's smart business buying. Learn more at amazonbusiness.com. Mortgage rates top 7% what it means for the housing market. And for parents seeking child care services, inflation isn't letting up. Child care costs for a lot of families are one of the biggest expenses. I've talked to some families who say that child care is actually a bigger expense than their mortgage, than their car payments, you know, other big ticket items. Plus why a major health insurer wants to scrap the complicated drug pricing system. It's Thursday, August 17th. I'm Anne-Marie Fertole for the Wall Street Journal. This is the PM edition of What's News, the top headlines and business stories that moved the world today. Mortgage rates have hit their highest level in more than 20 years. The average rate rose to 7.09 percent, according to data released today by mortgage giant Freddie Mac. The housing market is the sector of the economy hit most directly by the Federal Reserve's rate hikes, which have raised borrowing costs. Personal finance reporter Veronica Dagger has more on the possible paths ahead. Many economists think they're going to ease off a bit by year end. The Fed is so much of what they're watching. There's a big Fed meeting in September. So if the Fed then says inflation is contained, then mortgage rates are likely to slide down to about 6 percent. And that's from the economists of the National Association of Realtors. Though if the Fed continues to be aggressive and raise rates, then mortgage rates could hit 8 percent. And we're going to really see a big slowdown or a bigger slowdown in the housing market. If that's the case, a lot of people think. Another factor in the mix, the 10 year Treasury yield, which is closely tied to mortgage rates, reached its highest level since 2007 today. For more on rising mortgage rates and what consumers can expect going forward, listen to tomorrow's episode of the Wall Street Journal's Your Money Briefing podcast. In earnings news, Walmart said sales and profit grew in the most recent quarter. Given the retailer is known for low prices, it's another sign that American consumers are looking for deals. Walmart's U.S. comparable sales rose 6.4 percent last quarter. The company said it gained market share in groceries, which count for the bulk of its U.S. revenue. Walmart, which is the country's biggest retailer by revenue, also raised its full year financial outlook. Now, a rare look into the finances of Elon Musk's rocket company, SpaceX. The privately owned firm brought in one and a half billion dollars in revenue in the first quarter this year and 55 million dollars in profit. That's according to documents viewed exclusively by the Wall Street Journal. The slim earnings came after two years of narrowing losses at SpaceX, which is pouring money into Starship, a rocket that remains unproven. Still, SpaceX is the dominant rocket launcher in the U.S. NASA is dependent on the company. The agency doesn't have a domestic alternative to SpaceX for flying astronauts to and from the International Space Station. We report exclusively that health insurer Blue Shield of California wants to scrap the complicated playbook on drug pricing in an effort to save millions on drug costs. The insurer plans to drop CVS Health's care mark, its pharmacy benefit manager. Pharmacy benefit managers or PBMs negotiate drug prices and other services like mail order pharmacies. Blue Shield's plan is to partner with Amazon, entrepreneur Mark Cuban and others to perform specific functions. Amazon, for example, would offer at home drug delivery. Health insurance reporter, Ana Wilde Matthews has more. What Blue Shield says is that they are going to change the way things are paid for and make the functioning of the drug system more transparent. So right now they argue that clients don't really know who's making money along the line between the pharmaceutical manufacturer on the one end and the end patient on the other. Sort of they're all these different players in the mix there and they argue that you really don't know how each of them is making money along the way. And they also argue that many of those players have an incentive, make more money, arguably, if more expensive drugs are prescribed. So they feel that given that it tends to add costs. That's certainly not an argument that I think the big PBMs would agree with, I'd have to say, but that is their belief. So they say that by paying for drugs and paying for services related to drugs, hopefully in a different way, they will save money. Blue Shield estimates the plan will save the company five hundred million dollars annually, savings it says it will pass along to its clients. It hopes to fully launch the plan in 2025. Coming up, inflation may be cooling, but not for parents in the market for childcare. Why prices in that sector are staying high and may continue to rise after the break. Prices are easing in many sectors of the economy as inflation cools. But one area where that's not the case is childcare. The national average price of daycare and preschool services rose six percent in July from a year earlier, according to the latest data from the US Labor Department. That's nearly double the overall inflation rate, which now stands at three point two percent. And there are concerns the cost of childcare could rise even higher as we head into the fall. What does that mean for parents and providers? Joining me now with more is Wall Street Journal reporter Christian Robles. Welcome, Christian. Thanks so much for joining me. Thank you for having me. So we've reported previously on this show about the rising cost of daycare and childcare, especially during the height of the pandemic, when many parents were working from home. Why are the costs of childcare still rising now as we're seeing prices easing elsewhere? A great place to start would be to talk about supply and demand. Starting with demand, you know, as we've seen pandemic pressures relieve, a lot of workers have returned back into the office space. So we see an increased demand for childcare services. And then on the supply side of things, we see that there are wage pressures for providers specifically to stay competitive in the labor market. So providers have had to increase wages, which have met higher prices. And then, of course, there are higher overhead costs that providers are facing specifically utilities, rent, food, all of those goods and services. Another factor that is impacting the supply side is the end of pandemic era aid. There is a big twenty four billion dollar program passed by the federal government that help providers stay open, increase wages and pay high overhead costs. So when that pandemic era program ends in September, providers may have to relook at their budgets and think about the prices that they offer their families. You said demand has been rising. What is the expectation for this fall when kids are going back to school? Well, the expectation is that demand will be high. There is currently a shortage of child care providers. There are long wait lists around the country. There are empty classrooms. So demand is expected to be high. You spoke to some parents about what they're having to do to make ends meet. What kind of choices are they making? What kind of sacrifices are they making to cover these rising costs? Some of the parents I've talked to have had to cut specific items out of their budgets. So that can mean something as simple as eating out. That's more on the more common end of things. I've also heard from some parents who have recently picked up new jobs. One of the parents I talked to from Nashville recently just started to work as an Uber Eats deliverer in addition to her two jobs to help pay for child care. How do rising costs of child care impact the broader economy? What are some of the knock on effects we might see? Child care costs for a lot of families are one of the biggest expenses. I've talked to some families who say that child care is actually a bigger expense than their mortgage, than their car payments, you know, other big ticket items. So if families are spending a lot on child care that may crowd out spending on other goods and services, that could be the impact on the broader economy. We've also been reporting about women being pushed out of the workforce because of not being able to find child care. Is that a trend we're still seeing? Yes, definitely. We're still seeing that a parent, women especially, are being pushed out of the labor force. And that's in large part because child care is really hard to come by. And when people do have access to it, it's very expensive. So for some families, because of the high costs, it makes more sense to actually leave the labor force altogether. Wall Street Journal reporter Christian Robles, thank you so much for joining me. Yeah, thank you so much for having me. President Biden is scheduled to travel to Maui this Monday to survey the damage from what has been America's deadliest wildfire in over a century, claiming at least 110 lives. During the visit, the president will meet with survivors, first responders and federal, state and local officials, according to the White House. Meanwhile, residents and business owners are taking stock of the damage. Javier Barberi is the co-owner of three restaurants in Lahaina, one of which burned down in the wildfire. He told Jessica Mendoza on the Journal podcast that seeing the damage is surreal. It's like living in two worlds. It's like you live in this one world that's completely normal. Like when I get off the phone with you and I get in my car and I pull onto the highway, it's like a normal life. But the second you get into that zone, like Kapaluwa to Oluwalu, which is the West side that has been affected. It's like you entered a video game and you chose the really scary level. And you're in there and that's where you are. And you don't know what's going to happen. You know, you can hear more from Javier on last night's episode of the Journal podcast efforts to conduct a prisoner swap for detained Wall Street Journal reporter Evan Gershkovich and other Americans held in Russia have hit some setbacks recently. Last month, Brazil's government denied a request from the U.S. to extradite an alleged Russian spy in custody there. That's forced U.S. officials to leave the country. Focus on a deal involving Russian prisoners in U.S. custody, though it remains unclear whether Russia wants them back. Cybersecurity and intelligence reporter Dustin Volt says it's a complicated process. We're seeing the U.S. sort of look again to its own holdings, you know, the Russians that we do have in our possession because we've nabbed them or previously extradited them from other places. It's sort of looking at seeing who we have in our possession already that might be worthwhile to the Kremlin. And that includes potentially asymmetric deals where we maybe would have two or three lower level hackers or other criminal alleged criminals who, you know, maybe only have a couple years on their sentence left and maybe we could package them together in some sort of deal for one or two of our folks over there. So that's sort of where a lot of the attention is being paid right now within the Biden administration. The U.S. government considers Gershkovich and Paul Whelan, a former U.S. Marine, to be wrongfully detained in Russia. Russia's ambassador to the U.S. told reporters yesterday that Moscow and Washington operate a special channel dedicated to prisoner swap negotiations. He was speaking in response to a question about whether Moscow cared about the return of its citizens abroad following Wall Street Journal reporting that Russia has shown little interest in prisoner swaps for dozens of its citizens in U.S. prisons. And finally, travelers are increasingly worried about incidents like storms, wildfires and illnesses upending their vacations. And they're preparing for the worst by snapping up travel insurance so they aren't stuck with the bill when things go awry. IntelliTravel, a company that works with tens of thousands of travel advisors, says the number of clients who bought Alian's travel insurance rose 48 percent through June from a year ago. But there are other ways of protecting an expensive trip. Our reporter Ethan Steinberg has more. Travel insurance isn't always the best option. There are other alternatives that are simpler and may cost less. One is associated with premium credit cards. So often different credit cards will offer you some benefits of travel insurance if you're traveling abroad, as long as you book your trip with that card. The caveat there is that often with those cards, they will only offer you travel insurance and benefits associated with it up to a certain daily limit. So just be sure to read the fine print. And that's what's news for this Thursday afternoon. Today's show was produced by Pierre Bienneme and Anthony Bansi with supervising producer Catherine Millsop. I'm Anne-Marie Fertolli for The Wall Street Journal. We'll be back with a new show tomorrow morning. Thanks for listening."}, "podcast_summary": "- Mortgage rates have reached their highest level in over 20 years, with the average rate rising to 7.09 percent. This is largely due to the Federal Reserve's rate hikes and rising borrowing costs. The National Association of Realtors predicts that if the Fed eases off on rates, mortgage rates could slide down to around 6 percent, but if rates continue to rise, mortgage rates could hit 8 percent, which would significantly impact the housing market.\n\n- Walmart has reported growth in sales and profit in the most recent quarter, indicating that American consumers are still seeking deals despite rising inflation. Walmart's U.S. comparable sales rose 6.4 percent, with the company gaining market share in groceries. As the country's biggest retailer, Walmart's performance can be seen as a reflection of consumer behavior and preferences.\n\n- SpaceX, Elon Musk's rocket company, reported revenue of $1.5 billion and a profit of $55 million in the first quarter of this year. This comes after two years of narrowing losses for SpaceX, which has been investing heavily in the development of its Starship rocket. Despite the slim profits, SpaceX remains dominant in the U.S. rocket market, with NASA relying on the company for its space missions.\n\n- Blue Shield of California, a major health insurer, plans to partner with Amazon, Mark Cuban, and others to scrap the complex drug pricing system. Blue Shield aims to make drug pricing and the functioning of the drug system more transparent. The company believes that the current system contributes to rising drug costs and aims to save $500 million annually through its new plan. The savings will be passed on to clients, and the plan is set to be fully launched in 2025.\n\n- Childcare costs are continuing to rise, despite easing inflation in other sectors of the economy. The national average price of daycare and preschool services increased by 6 percent in July compared to the previous year, nearly double the overall inflation rate. The demand for childcare services has increased as more workers return to the office, while providers face wage pressures and higher overhead costs. The rising cost of childcare has a significant impact on families, often surpassing expenses like mortgage payments and car payments. It can also lead to some parents leaving the workforce altogether.\n\nThese are the top headlines and business stories as of August 17th.", "podcast_guest": "Olivia Hastings Holt (born August 5, 1997) is an American actress and singer. She starred in the Disney XD series Kickin' It, Disney Channel Original Movie Girl vs. Monster, and the Disney Channel Original Series I Didn't Do It. From 2018 to 2019, she portrayed the titular role Tandy Bowen / Dagger in the Freeform series Cloak & Dagger. In 2021, she portrayed Kate Wallis in Cruel Summer.\nHolt had voice roles in the films Tinker Bell and the Legend of the NeverBeast (2014) and Gnome Alone (2017), and starred in the feature films Class Rank (2017), Same Kind of Different as Me (2017), and Status Update (2018). Her debut EP, Olivia, was released on Hollywood Records on July 15, 2016.\nIn 2023, Holt made her Broadway debut as Roxie Hart in Chicago.", "podcast_highlights": "Here are the highlights from the podcast:\n\n1. Mortgage rates have hit their highest level in more than 20 years, with the average rate rising to 7.09%.\n\n2. Walmart reported growth in sales and profit in the most recent quarter, showing that American consumers are still looking for deals.\n\n3. SpaceX, Elon Musk's rocket company, brought in $1.5 billion in revenue in the first quarter this year.\n\n4. Blue Shield of California wants to partner with Amazon, Mark Cuban, and others to scrap the complicated drug pricing system.\n\n5. Childcare costs are rising and have increased by 6% in July, nearly double the overall inflation rate.\n\n6. President Biden is scheduled to visit the area affected by the deadly wildfire in Maui.\n\n7. Efforts to conduct a prisoner swap for detained Wall Street Journal reporter Evan Gershkovich and other Americans held in Russia have hit some setbacks.\n\n8. Travelers are increasingly buying travel insurance to protect themselves from incidents that may disrupt their vacations, but there are alternative options such as premium credit cards."}