{"podcast_details": {"podcast_title": "Baggage Unclaimed", "episode_title": "Things Netflix Is Hiding About Jeffrey Dahmer", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/21460029/21460029-1666655413947-13b55c2e9dff7.jpg", "episode_transcript": " Netflix's based on a true life story originals have always gathered somewhat mixed reactions, and its latest, more disturbing production, Dharma Monster, the Jeffrey Dahmer story, is no exception. The limited crime drama series, which follows the life and murders of Jeffrey Dahmer, the Milwaukee Cannibal, is more or less a documentary biography. However, like most of Netflix's real-life crime documentaries, there are some hidden truths about Dahmer the show omitted that will leave your jaw hanging open. Today, I will be showing you the things Netflix is hiding about the events of Jeffrey Dahmer's murders and downfall. Number one, going against the sources. One of the reasons why the true crime series was so detailed was because of Jeffrey Dahmer's confessions and interviews. According to some people who had one-on-one interactions with him during his life, Dahmer was fairly forthright and cooperative. One such person was American television host, Nancy Glass. Bill, when I sat down opposite Jeffrey Dahmer for this interview, I wondered what he would tell me, how hard it would be to get him to discuss his horrific crimes. What I found was that he was very forthcoming. He volunteered details that may be difficult to hear. Aside from his interviews and videotaped confessions, Netflix also had the testimonies of Dahmer's family and the families of the victims to work with. Throughout the show, you can see that Netflix went to great lengths to produce the series with detailed accuracy. This detailed accuracy is particularly evident in the scene where the family members of the victims are allowed to speak during the court proceedings. Their speeches contained almost the exact wording as the actual court transcripts. Sound familiar? However, there are times in the show when the true life story becomes a lot less true because there's been some sort of deviation from the authentic accounts. One of the scenes that shows Netflix going against Dahmer's words is the scene where Dahmer was working as a phlebotomist. In the series, he is shown stealing a bag of blood and taking it home to satisfy his cannibalistic fetishes. While you probably considered the scene a bit weird and a little gross, I bet you didn't know that it is an extreme exaggeration. The actual incident that occurred went differently, as described by Dahmer himself. While speaking on the incident, Jeffrey said that he only tried a vial of blood on the rooftop of the center where he worked to see how it tasted. He also claimed that he spat out what little he had taken and, well, let me just say that this is a different picture than the one Netflix painted. Considering the insane amount of source material that was readily available to the production service, you are probably wondering why they would intentionally go against the truth. Well, two words, dramatic effect. With that said, I would take a few scenes in the series with a pinch of salt if I were you. Number two, Glenda Cleveland's involvement. I know, but nobody hurt me. Was Glenda Cleveland's chilling statement that got everyone's attention and even some goosebumps in my case? According to actual events, Glenda Cleveland was a significant figure in the months before and after the arrest of Jeffrey Dahmer. Glenda's involvement in the events was strongly highlighted by Netflix and their show, with good reason. But was there more to her involvement than what Netflix was letting on or less? Well, for starters, the show depicted Glenda as Dahmer's neighbor in the Oxford apartments. She was even the subject of an unsettling scene where she was made to eat a suspicious sandwich by Dahmer. In actual events, the real life Glenda Cleveland wasn't a neighbor of Dahmer's. She didn't even live in the Oxford apartments. Instead, she lived in a different building adjacent to it. And there was no indication that Glenda and Dahmer had ever met prior to her meeting him on the street with one of the victims, Conorak Synthesompheny, before his death. The unsettling sandwich scene was another Netflix add on that really happened to Pamela Bass, a lady who was actually Dahmer's neighbor. Judging from how it all played out, many have come to the conclusion that Netflix may have tried to mix the characters of Glenda Cleveland and Pamela Bass to be more fitting for their storytelling. That decision has come to be known as one of the most significant deviations from actual events that Netflix served up instead. Also, the fact that the real life Glenda didn't live in the same building with Dahmer throws off the depiction of Glenda noticing telltale signs of his murder and her long suspicion of him. Although facts have it that Glenda grew suspicious of Dahmer after the Synthesompheny incident. When the suspicions arose, Glenda repeatedly tried to notify the cops of Dahmer's antics, especially after she saw a story of him being missing in a newspaper. Notwithstanding, Glenda's calls were dated about seven weeks before Dahmer was arrested and the most noticeable one. Glenda made this call to the authorities after she found a badly injured Conorak Synthesompheny trying to escape Dahmer's apartment. However, the officers tasked with handling the case ended up delivering young Conorak back to Jeffrey. While it is true that Glenda did call the authorities, her calls did not go on for months and months as was narrated by Netflix. What did I tell you about taking the story with a pinch of salt? Number 3. False TV Reports The commendable accuracy of the series makes it very tempting to believe that the news reports and occurrences surrounding the actual events were also accurate. Unfortunately, that is not the case. In fact, the news reports on the series were a lot less accurate than viewers were made to believe. The very beginning of the series shows Glenda watching a news report that says, this headline is then accompanied by more descriptions of the events. While this does sound like a real event that might have occurred in Milwaukee, there is no record of an incident fitting this description, especially during the time surrounding Dahmer's arrest, which happens in the later scenes. Considering the many things that did happen during that time, the show's producers could have strived for more accuracy. Another news report in the series mentions a fire raging in a community called Stafford. If the name doesn't sound recognizable, it's because that community doesn't exist. The series also mentioned the shutting down of an Alice Charmer's plant operation when, in reality, the manufacturing giant closed down years before the Dahmer events in 1985. Number 4. Officers of the Year. This is one of Netflix's hidden truths that I just couldn't wrap my head around. It's a brief scene that showed officers John Balczewski and Joseph Gabrysz receiving an Officer of the Year commendation. Those were the same cops that infamously returned 14-year-old Conorak Synthesumphony to Dahmer, who then killed him. After delivering Synthesumphony to his killer, the officers radioed the station and had this to say. The intoxicated Asian male has been returned to his sober boyfriend and we are tenate. In addition to their disturbing negligence, the officers had previously stepped into Dahmer's apartment for a look around and failed to notice the unhidden body of the previous victim, Tony Hughes, in the bedroom. Not exactly stellar police work that deserved an award, if you ask me. And that was the case, indeed. In actuality, the pair were fired from duty after Dahmer's arrest by their police chief for a poorly done job. Although they were reinstated by a judge a few years later after an appeal and were given the opportunity to continue their careers, the pair certainly weren't given or deserving of an award for what happened. Netflix seemed to think otherwise for some reason and showed so in their series, but now you know the hidden truth. Number five, Sandra Smith's arrest. A more quiet voice behind the now iconic line, I knew but nobody heard me, was Sandra Smith, daughter of Glenda Cleveland, who was among the original trio that found victim Conorak Synthesumphony outside Dahmer's apartment building. The series showed Sandra being arrested for assaulting a curious onlooker and smashing his camera. There was, however, no known record of this ever happening. It is most likely another embellishment by Netflix to make Glenda Cleveland and her family more emotionally involved in the Dahmer case than they actually were. Number six, Conorak Synthesumphony's kidnapping. 14-year-old Conorak's murder was a particularly controversial one among all Dahmer's marks. It was his almost escape from death that brought on Glenda's growing suspicion in the first place and it also sparked tensions concerning police negligence and racism because of Detective John Balczewski and Joseph Gabrysh's actions. The issues concerning his death were no cakewalk. There was even a coincidence of Conorak's brother being a known early sexual assault victim of Dahmer's. While all these details are portrayed in the series, there is an aspect that might have slipped through the cracks. The series shows Dahmer approaching Conorak in a convenience store and swaying him with beer and a promise of cash for some pictures when in real life Dahmer confessed he met Conorak at the Grand Avenue Mall. Number seven, the judge and the law. A lot of people received widespread criticism after Dahmer's arrest because there were one too many times where he danced to the edge of the law with his disturbing crimes. Many people were of the opinion that some of it, if not all of his murders, could have been prevented and one of the many people who were on the receiving end of the blame was Judge William Gardner. He was responsible for sentencing Dahmer after his first brush with the law for sexually assaulting a minor, someone who coincidentally was the brother of his later victim, 14-year-old Conorak St. Thessomphani. Judge Gardner received a lot of backlash for his lenient sentencing of a proven sex offender at that time. Many even came out to say that a harsher sentence might have prevented some of Dahmer's murders. However, none of this is brought to light in the series. Another part of Dahmer's story that you don't see in the series is the amount of criticism his probationary officer received. After serving his sentencing for the sexual assault case, Donna Chester, Dahmer's probation officer, had appointments to check in with him at least twice a month. This was during the time his murder spree had started and Donna never even got a whiff of it. The outrage towards Donna seems to be well founded because her doing a good job would have mitigated Dahmer in some ways, but as a result of her negligence Dahmer remained unchecked. This was the cause of more of the widespread criticism that went around after Dahmer's arrest. Number 8. The Lucky Jogger. At some point in the series, we learn about a lucky jogger who would have been Dahmer's first kill. During his spree, Dahmer grew fascinated with a jogger that ran past his house regularly and soon his fascination grew into a murderous obsession. He began to think about attacking the jogger with a baseball bat and in due time, thoughts became plans and then he found himself with a baseball bat in hand, waiting for the jogger along his usual path in a secluded area near his house. Fortunately, Lady Luck smiled on the jogger that day. He didn't show up for his regular run and that was it. In Netflix's show, however, Dahmer ends up stalking the lucky jogger with his baseball bat. He approached the jogger amicably and lured him to his home with drinks, a very different tale to the one that we now know to be true. Netflix, however, snapped to their senses and made the whole interaction with the jogger a fantasy of Dahmer's. What do you think? Did Netflix do a good job of narrating the lifestyle and murders of Jeffrey Dahmer? Did you enjoy this video? Check out more awesome ones on the Fugitive channel. Thanks for watching and we'll see you next time."}, "podcast_summary": "Netflix's true crime series, \"Dahmer: Monster,\" based on the life and crimes of Jeffrey Dahmer, has been praised for its attention to detail and accuracy. However, there are several instances where the show deviates from the true story. For example, the scene where Dahmer steals a bag of blood to satisfy his cannibalistic desires is an exaggeration. Dahmer himself stated that he only tasted a vial of blood to see how it tasted. The series also portrays Glenda Cleveland, a key figure in Dahmer's case, as his neighbor, when in reality, she lived in a different building nearby. Additionally, the news reports in the series contain inaccuracies and the depiction of officers receiving an Officer of the Year commendation is false. There is no record of Sandra Smith, Glenda Cleveland's daughter, being arrested for assaulting someone. Other deviations include the location of Conor Ochsendorfer's kidnapping and the criticism faced by Judge William Gardner and Dahmer's probation officer, Donna Chester. Despite these discrepancies, the series remains gripping and offers insight into the mind and actions of Jeffrey Dahmer.", "podcast_guest": "Nancy Glass  is CEO of Glass Entertainment Group and formerly an American television and radio host.", "podcast_highlights": "In this podcast episode, the host discusses the Netflix series \"Dharma Monster: The Jeffrey Dahmer Story\" and reveals some hidden truths that the show omitted. The host highlights several deviations from the authentic accounts of Dahmer's life and crimes. These include exaggerated scenes for dramatic effect, inaccuracies in the portrayal of Glenda Cleveland's involvement, false TV reports, inaccuracies in the depiction of officers Balczewski and Gabrysz, and the arrest of Sandra Smith. The host also points out some discrepancies in the series' portrayal of Conorak Synthesomphony's kidnapping, the judge's sentencing, and the lucky jogger incident. Overall, the host suggests that viewers should take certain scenes in the series with a pinch of salt and questions whether Netflix did a good job in portraying the true story of Jeffrey Dahmer."}