{"podcast_details": {"podcast_title": "Seriously...", "episode_title": "An Almanac for Anxiety: In Search of a Calmer Mind - Episode 1", "episode_image": "http://ichef.bbci.co.uk/images/ic/3000x3000/p0cf9m6j.jpg", "episode_transcript": " This is the BBC. This podcast is supported by advertising outside the UK. BBC Sounds music radio podcasts. Hello and welcome to Seriously from BBC Radio 4. I'm Helen Needham, the host of the Radio 4 series, An Almanac for Anxiety, in search of a calmer mind. In the series, I look at simple ways we can help to reduce stress and anxiety through the power of nature, from sitting around the campfire to breathing deeply and sinking our hands into the soil. To listen to all the episodes, just search for An Almanac for Anxiety on BBC Sounds. On the banks of the River Spey near Aviemore in the Highlands of Scotland, a fire is being prepared. The fire will form the centrepiece of an overnight camp led by Gerry Ward, founder and director of Fire and Peace, a charity offering nature therapy to people with addiction and mental health issues. And then flint and steel, a bit of flint and my hardened tempered steel. Put the two of them together and we get sparks. But we need to get that spark. I'm Helen Needham and I've been involved in making radio programmes about nature and the outdoors in Scotland and beyond for almost two decades. Over the years, I've observed the transformative effects of spending time in the outdoors for people. In this series, An Almanac for Anxiety, In Search of a Calmer Mind, I explore this in more detail with a particular focus on the four classical elements, air, water, earth and fire. Plus, as the writer Edward Thomas elected it, the fifth element, wood. When it goes up, it goes up quick. In episode one, we form a circle around the fire. OK, not me, we've gone up. Fire is what distinguishes us from other advanced mammals. We're the only species that can use and create fire. And a lot of anthropological theories go that that's what's actually made the difference between us and other advanced mammals. And that's what sets us apart. So it's very much part of who we are. It's the power of the fire, isn't it? It's a magnet. It just draws people in. It makes you feel safe, secure, comfort. It gives comfort. And as the day goes on, the fire gets more and more powerful and people start connecting with it stronger. And that's where we see the real magic happening. I've grew up in a kind of a deprived area in Glasgow, you know, so it was kind of hard for me growing up. Just the stuff you need to see is a youngster. Jay is a youth ambassador for Fire and Peace. He's experienced firsthand the benefits of escaping the city and spending time outdoors around the fire. Anxiety, depression, all that mixed with your school life, your exams, all that stuff. But it was hard, you know. So that's why now that I've got the tools to better myself, I want to come out and I want to help other people with the same kind of problem. Do you still live in the same area? Yeah, I was born and bred in Drumchapel. You know, it's hard to get out of that kind of place when you're so used to it because you don't know any different. You know, the drugs, the violence, that's why youths are turned into that kind of stuff because they don't know anything else. That's a bit like brought up in. So there's not really much for them to get up to. So they resort to other stuff that's not too good for them. They get some into bar and stuff. Had you ever had an experience like this before of being actually out in somewhere in the countryside spending time in nature, spending time around the fire next to a river? No, that was the first time I had ever slept outside. I've always had an interest with the outdoors, you know, but I've never looked back since, you know. So now that I've got the skills to camp outside, I go myself, I go with my friends. So it's good skills to have. It's a sense of achievement, you know. I can sit back and I can say, I built that fire. I'm looking after that fire. You know, I'm showing people how to be safe around the fire. It's a sense of you've done something because you feel free out here, you know. Nobody can touch you up here, you know. You're away for, you're at least three years away from Glasgow or wherever you stay. When I'm in the city, I feel trapped, you know. But when you come out here and you're never trapped, the sky's the limit, basically. Do you feel safe here? No, I feel 100% safe here because I know that nothing can happen to me up here. I might get burnt, I might get cut, but that's all kind of part of the fun. But when I'm back in the city, you know, you're always watching your back. Just the way I grew up, you know, you always had to look over your shoulder. So I definitely feel 100% safe here. Right, folks. We do a wee exercise. We've always done it around the fire. We pull out the log exercise. I've got a pen on me here. I call that the square world out there. We get forced into boxes the day we're born. We're not square people, we're circular people. And this is the circular world we're in at the moment. The fire's a part of the circular world. We're circular, but we get forced into squares. And this is where the real connection happens. Not out there with plastic and concrete and steel, but in here, the river, the wood, smells, touches, feels, and each other, getting to know each other, connecting with each other again, and first and foremost, ourself. My name's Jade. I'm from Fife. Anxiety takes over quite a lot of my life. It's that bad that I have an eating disorder through my anxiety, and I start to stir a little bit. And that used to annoy me, because I thought folk would laugh at me. But there's nothing there I don't feel ashamed of. Everybody has problems. Everyone's got this or that. But some folk don't open up about it. Where I'm sick of hiding behind a mask and putting a face on, saying, oh, I'm fine, I'm fine. But now I'm just an open book. I've been an addict, but I can recover. Anyone can recover. If you put your mind to it, you can do it. And when you've got all the right support behind you, it's a lot easier. And what is it about being around the fire in particular in this experience? It's hearing everybody's stories. They share what they've been through. You can connect. Because if you go to the recovery cafe, you might not have the same connect, like same issues what they've got or the same addiction that they've had. So there's maybe about 32 folk with us a day. Some might have mental health, some might have addiction problems. But some of us are not going to have the same addiction or same mental health problems. So there's somebody that you talk to and you're not getting judged. And they're going to listen to you and truly understand what you mean by it. And why do you think it is out here sitting around the fire that you don't feel judged? What is it about this particular thing about having the fire in the middle of the circle there? It's a connection because it's a big circle. It's like what it brings us as a family. I just feel like it's my second home. The use of a fire extended the day for an early man. And from there, that led to the opportunity for cultural transmission through stories. Lynne Moyer is a masters student in outdoor education at the University of Edinburgh. Her thesis, Tales from Around the Campfire, addresses the lack of research on this subject in her field and gathers personal experience and anthropological studies to understand why sitting around a fire can offer the perfect setting to share stories. Now, these stories absolutely on the whole were told when tribes gathered round fires. And it's very difficult to uncouple the campfire from the storytelling. And it's exactly the same now that when you get a campfire and people are sharing around that campfire, that's an opportunity for cultural transmission, which otherwise might not happen because our way of communicating now can be online, it can be through one-way media like the television. Basically, someone will share their life story. As night falls, the group gathers around the fire for the share. This is where one person shares their personal story, uninterrupted, with the group, common practice within recovery settings across the globe. The first share was here, the dark before. It's a powerful scene, faces lit by the flames in the darkness, everyone's attention on the flicker, but ears drawn to the words of the teller, who on this occasion is Jai. My name's Jai, I'm an addict. My name's Jai, I'm a survivor. It's always a privilege to share. I believe wholeheartedly in the power of sharing. It was through hearing people sharing that I was able to pinpoint... I didn't record all of Jai's story because of confidentiality. What happens around the fire stays around the fire, but I can tell you that it involves severe childhood trauma, drug addiction, crime, violence and loss. Obviously I mentioned about my son passing away when I was nine months clean, because it was a big step in my recovery, because I could have went to the other way for me. It's then I realised that the first time ever I made a real choice for myself, I was right then when my son passed away, the next day I put myself back into the actual rehab. When I'm sitting here, I can let out how I exactly feel about my son passing, how it's affected me. It's starting to feel like it's affecting me right now actually, and I try and fight it, but I know I shouldn't, but the fire destroys that stuff right out of me. I love it. Unbelievable. When I believed in myself, it started coming here. I talk about a lot of stuff that's not so nice, but it's relevant to where I am now. When you share here, you're just staring at the fire, and you just forget all these people are there. It's just like you're talking to the fire and not the man. That's for definite. This is my shit, and I own my shit. Nobody's got any power over me. I'm the only person with power over me. It's a bit vulnerable. It's the biggest thing, and the fire does that. The power, it's magic. I know it sounds like a thing of the word, but it is magic. It destroys it out of you. It's something you need to be here and be part of to experience it. One of the key things that I found was that being around a campfire leads to group cohesion, and you have a sense of belonging, which is actually quite difficult to replicate outside of the campfire experience. It's something that's actually innately within us, and has been with us for thousands of years. It's really just in the 20th century that we've disconnected from either the campfire or the hearth as a place to gather. One of the things that's really interesting in the study which came up from an anthropological point of view was that the dimmed light from the campfire means that people are less inhibited than they maybe would be. So you're not staring directly into somebody's eyes. Most people are looking at the flames, and that gives them a sense of calm and the ability to open up around others around them. There's some really interesting studies that have looked into how being around a fire actually lowers your blood pressure, and it's very early research, but I think there's a huge amount of things that could be done to follow that research up. At the minute it's all anecdotal, but I think we all know that staring around a flames has a mesmerising effect on us, and it also helps us relax and actually focus on the here and now rather than dwelling on a future or the past. I love the smells of it. The smells can just snap you right back to instant anchoring. As soon as you smell that resin from the pine, it just snaps me back to being in the forest. Yeah, my favourite place where I'm going to live one day in the forest. I've sold. I'm going to buy a forest. Aye, can I move in? Aye. It's all about the community by the way, just like this. To be self-sustainable as possible, get away from the madness of the world we're in at the moment, and proper connection. We forget we're allowed sometimes though. So wood might be a killer, aye? Absolutely, 100 per cent, yeah. Fires do come with their own risks and should be managed carefully, especially during dry spells as they can easily get out of control and cause wildfires. So if you are going to light a campfire, do it responsibly and only in areas where it's permitted. And of course, leave no trace. It's clear from my experience with the group on the banks of the River Spey that it's the simplicity and the freedom offered by such a setting which is so meaningful. A place to be around the fire, to connect, to share and to heal. Everybody in the world's in, recovering from something. From a marriage breakup, recovering from losing their job, recovering from an operation. Recovery is all the thoughts and the feelings and the emotions that goes with it. It's the same for everybody, you know what I mean? So everybody should have this opportunity, I day believe, you know what I mean? Get away from that square world, get back into nature. There's not enough of this. Definitely not enough of this. Change your thinking on things and being free and just being able to express yourself, you know what I mean? Definitely. I saw a footprint. I'm Andrew Benfield and I'm obsessed with the Yeti. The fist looks like some kind of monkey. The idea of a Yeti-like creature has been around for centuries, but could it be real? In Yeti, a new 10-part series from BBC Radio 4, I'm going to try to find out. I'll be joined by a good friend. You said we were going for a short walk across the valley. I'm Richard Horsey. This search isn't going to be easy. They have the ability to disappear. Are we chasing phantoms? Yeti chase us and never find them. But in this series, we think we might. Listen to Yeti on BBC Sounds."}, "podcast_summary": "In the podcast series \"An Almanac for Anxiety,\" host Helen Needham explores the power of nature and the outdoors in reducing stress and anxiety. In one episode, she joins a camp led by Gerry Ward, founder of Fire and Peace, a charity that offers nature therapy to those with addiction and mental health issues. Sitting around the campfire, participants share their stories and find comfort and connection in the experience. The fire acts as a magnet, drawing people in and providing a sense of safety and security. Whether it's escaping the city or experiencing the outdoors for the first time, participants find solace and a sense of freedom in nature. The campfire also serves as a space for cultural transmission and storytelling, allowing individuals to share their experiences and feel truly understood. Being around the fire lowers inhibitions and creates a sense of calm. The soothing effect of the flames can even lower blood pressure. Overall, the campfire experience offers a place of belonging, community, and healing. However, it's important to manage fires responsibly and in permitted areas.", "podcast_guest": "Gerard Adams (Irish: Gearóid Mac Ádhaimh; born 6 October 1948) is an Irish republican politician who was the president of Sinn Féin between 13 November 1983 and 10 February 2018, and served as a Teachta Dála (TD) for Louth from 2011 to 2020. From 1983 to 1992 and from 1997 to 2011, he followed the policy of abstentionism as a Member of Parliament (MP) of the British Parliament for the Belfast West constituency.\nAdams first became involved in Irish republicanism in the late 1960s, and had been an established figure in Irish activism for more than a decade before his 1983 election to Parliament. In 1984, Adams was seriously wounded in an assassination attempt by several gunmen from the Ulster Defence Association (UDA), including John Gregg. From the late 1980s onwards, he was an important figure in the Northern Ireland peace process, entering into talks initially with Social Democratic and Labour Party (SDLP) leader John Hume and then subsequently with the Irish and British governments. In 1986, he convinced Sinn Féin to change its traditional policy of abstentionism towards the Oireachtas, the parliament of the Republic of Ireland. In 1998, it also took seats in the power-sharing Northern Ireland Assembly. In 2005, the Provisional Irish Republican Army (IRA) stated that its armed campaign was over and that it was exclusively committed to peaceful politics.In 2014, Adams was held for four days by the Police Service of Northern Ireland for questioning in connection with the 1972 abduction and murder of Jean McConville. He was released without charge and a file was sent to the Public Prosecution Service for Northern Ireland, which later stated there was insufficient evidence to charge him. Adams announced in November 2017 that he would step down as leader of Sinn Féin in 2018, and that he would not stand for re-election to his seat in Dáil Éireann in 2020. He was succeeded by Mary Lou McDonald at a special ardfheis (party conference) on 10 February 2018.", "podcast_highlights": "The highlights of this podcast episode titled \"An Almanac for Anxiety\" from BBC Radio 4 are as follows:\n\n1. The episode explores the transformative effects of spending time in the outdoors and connects it to reducing stress and anxiety.\n2. The four classical elements, air, water, earth, and fire, are discussed, with a focus on the fifth element, wood.\n3. The episode features interviews with individuals who have found solace and healing through nature therapy, particularly around the campfire.\n4. The power of the fire and its ability to create a sense of safety, security, and comfort is highlighted.\n5. The episode explores the importance of sharing stories around the campfire as a means of cultural transmission and a way to connect with others.\n6. The therapeutic benefits of being around a campfire, including lowering blood pressure and promoting relaxation, are discussed.\n7. The importance of community and connecting with others in a natural setting is emphasized.\n8. Responsible fire management and leaving no trace are highlighted as important considerations when lighting a campfire.\n9. The episode concludes by advocating for more opportunities for people to experience nature and its healing effects.\n\nIn terms of hot topics and controversial ideas, the podcast does not delve into any contentious issues. It primarily focuses on promoting nature therapy and the benefits of spending time in the outdoors."}