{"podcast_details": {"podcast_title": "Kyle Meredith With...", "episode_title": "They Cloned Tyrone Filmmakers on Clones, Conspiracies, & Erykah Badu’s New Version of Tyrone", "episode_image": "https://media.redcircle.com/images/2023/3/6/22/ae7cee03-4bc8-4cd6-9f9f-556d77714848_b08a77a31a_4617887-1621020968777-0e525622ca1e3.jpg", "episode_transcript": " It's easy to hear your favorite artist on WFPK from wherever you are. Listen on your smart speaker live stream from our website at WFPK.org from Louisville Public Media. We're pink. Okay, here we go with the. Consequence Podcast Network. Puny humans of the world, we interrupt this podcast to let you know that Guar are back with a brand new line of CBD products. That's right. Your favorite intergalactic barbarians have introduced new dank ages featuring Delta 9 flour, Delta 8 and THCP gummies, and a Berserker vape cartridge. But wait, there's more, including a rolling machine, a tray and a t-shirt. Get in touch with your inner scum dog by visiting ButtOfGods.com where items are available to ship now. Hey, welcome to another edition of Kyle Meredith with It's the Interview Series presented by WFPK at WFPK.org Consequence and the Consequence Podcast Network. Thanks, as always, for making your way here, check out the series. I do hope you hit that subscribe button, of course. Do three new interviews every single week. It's a new one every Monday, Wednesday and Friday. So it's a great way to keep up with your favorite artists and discover the new ones at all usual spots, including Spotify, Apple Podcasts at NPRWFPK.org, YouTube for the video versions or anywhere you get your podcast from. You can subscribe to Kyle Meredith with. Recent episodes have included guests like Madison Beer and Fozia, both talking about their new music. We've had Matthias Schweikhofer and Tom Harper to talk about the new Gal Gadot movie Heart of Stone. Bethany Cosentino of Bestco stopped by. We had Keanu Reeves and his band Dogstar, the cast of Minx with Elizabeth Perkins, Ellie Kemper of The Office and Unbreakable Kimmy Schmidt, Emily Kenny of The Walking Dead, as well as Bruno Major, Janelle Monae, Greta Van Fleet, Ian Hunter, Lucinda Williams, Nick Haxam of 311. Those are just some of the recent guests that we've had here on the Kyle Meredith with podcast and what you get when you subscribe. I'm Kyle Meredith. Today, my guests are filmmakers Jewel Taylor and Tony Renton Meyer. We're going to be talking about the Netflix film They Clone Tyrone. Came out just a few weeks ago. It's a movie that that follows three friends as they discover and ultimately uncover an underground government cloning operation running experiments in the midst of their own town. And it stars Jamie Foxx, Teona Paris and John Boyega. So going to be talking about Jewel and Tony, who co-wrote the movie together with Jewel directing. So we'll get to hear about the feelings they had of helming their first major picture and the fun of world building and coming up with the small and specific character traits of the throne, as well as watching fans make their own art after watching it. They're also going to talk about the underlying messages of the story from conspiracies and capers will dig into the music of the film, calling back to 70s and 80s funk and pop and R&B. And if you've seen it, how they got Erika Badu to rerecord one of her classic tracks. All that and more as we're talking, they clone Tyrone. It's Kyle Meredith with Jewel Taylor and Tony Rentenmeyer. Hey, what up guys? How you doing? It is a pleasure to meet you both. And they clone Tyrone. I know you're getting lots of compliments. And let me just be one more on the pile that this is one of the coolest, funniest, weirdest, best movie I've seen lately. And I mean that seriously. Like, I didn't read a lot about what I was getting, what I was, you know, seeing as I was going into it, me and my wife watching it. And it ends up just being like, what? So many times. So just first off, congratulations. Like, I love what you guys have done. I think weirdness is the best compliment in that list in terms of what we're, what we want to do and stuff. Well, there's a lot that goes into it. And I do want to hit on some of the weird parts too. But for this to be your all's, I mean, you've worked in movies, you've got, you know, your, your, your filmography behind you, but this is the first big thing right here. This is the first big thing that, that, you know, you're putting your names on. What's the confidence level going into a moment like this? You mean pre, pre making it? Yeah, like, like, hey, here's the keys to the kingdom. Now you've got it. Now what? You're on the precipice of day one of shooting and you're like, oh, you know, honestly, I think we feel like we were confident, but you know, there's always, you know, we've talked about this a few times, you know, there's always a pervasive sense of imposter syndrome and anxiety that's inescapable in a lot of ways, you know, especially like the closer you get to the first day of shooting and Jamie Foxx is in the first scene and you have no idea what it's going to be like to work with Jamie Foxx. So, you know, I think we, we try not to leave it to chance to put like that. So we had backup plans for backup plans and you know, I think, you know, we sat down and blocked out that first day, three, four different ways, just in case they're not rocking with this, we're going to shoot it like this. If you're not like that, it's okay. It's okay. We'll start the scene over here, you know, and then, you know, I think we got a lot of confidence from how just approachable the actors were, you know, I think it's the fact that like John, Jamie and Tiana were so, you know, gracious. I tell people all the time, I would not have, I would not have taken the role if I was an actor. You know, if the shoe was reversed, I would not put my faith in some random dudes from USC who, you know, they were like, Oh, you know, I'm going to be a good actor. I'm going to be a good actor. And I'm like, I'm going to be a good actor. And I'm like, I'm going to be a good actor. And I'm like, I'm going to be a good actor. And you've never heard of, I would not have, you know, I'm saying so we are eternally grateful that they, that they responded to the material the way they did. And, you know, I think they, they gave us, you know, The confidence just to stick with the idea, you know, and then stick with the vision. You know, while we were, we were shooting really. You know, they were so game too. And so they were like, Oh, you know, I'm going to be a good actor. And I'm like, I'm going to be a good actor. And so I think that's the way we're working together. So long. Do you, I mean, Is it down to like a shorthand? What's, what's the operating relationship at this point? Yeah, it is. Honestly. I don't notice it when we're working together. But if ever we were talking to someone else, There's there's a little bit more like leg room. Room that needs to go into like explaining idea to someone else versus us too. You know, I mean, I think it's also. It's a time where we're like, I don't know if we're going to be able to do it in a way that's like a more, you know, A lot of times. I don't know how we think a story or a scene should go or anything. But I think we've, and we argue a lot about how, you know, argue about like details of stories or scripts, like, and sometimes about like things that are truly minuscule. You know, but I, The things that have been a. Yeah. Because what matters, what matters to both of us, like those little details is different. Like I think one of our longest arguments on Tyrone was about like the first argument that we had was like, We're going to argue all the time. And we're like, So what's the best argument to argue about? And we have to argue about the argument. We have to like, We have to feel the ground and like it, if they come up and it's night, if it's weird, like some small thing like that. But we've, We've done it enough. That like now we trust each other so much that like, if we're arguing about something. We'll lean into the argument because we know that like, if we argue about it enough, they'll be like a third option. That's better than either the two that we are fighting for. that's better than what either one of us thought of. That takes a lot too, just knowing that if you're in the middle of that, that you will eventually make it to that moment. Yeah, it's funny, you know, talking about coming up with those rules too, how long they spend underground, you know, like you all get that opportunity, you get to build, you get to make up these rules as you go along and to figure that out. And I know that's just part of the job, that's part of the storytelling, but like, but like how much like, I was starting to think like the little things, like do the clones age, you know? Yeah, we talk about all this stuff. We talk about things like clone drift, in terms of like how far they drift from their like, mentoring and programming, you know what I mean, in terms of, so you know, trying to plant evidence of, you know, the first Fontaine and evidence of his drift, you know what I mean? And we talk about the ennui that the clones must feel like having. Like stupider stuff, like where in the decanting process do the clones get their hair done? You know, like when they're in the tube, should they be all cut up or is that like somewhere like when they get out, like all this? And it is like the fun stuff, honestly, like all that world building, even if it doesn't actually make it directly into the film, it like makes the process fun, you know, sitting in a room for hours on end, just like typing something out. That's always the fun thing, you get on set, you take a lot of times you talk hours about these details, but like production things will, will decide them for you. We talk so long about like what hairstyles the actors have, I mean, the clones have, and then you realize like you're getting background who's willing to be moved in a pod, you know what I mean? And then the time constraints is like some of them just have a hairstyle, like, you know, we had decided like natural hair, they'll all have like afros and that, and then like, I probably shouldn't say this because now people are going to point, now people are going to find, you know, inconsistencies in the internal logic, but you know, you run into some real life, like casting and timing things where you don't have the time to do the people's hair the way we made this lore and it's like, I guess some people just going to have hairstyles that we have to hide, you know, with smoking nigger, so if you look closely enough, you'll see a few clones that come out of the pods who very much have like braids and like, you know, like hairstyles, absolutely not lore accurate at all. Our little bootleg lore that we made, but you know, sometimes you just got to deal with like the production realities. So, you know, a lot of times we do obsess over things that like, when it gets time to make it, it's like you end up conceiving them anyway. Well, as the world builders yourself, I mean, you can make up those backstories if you needed to, like, it doesn't matter what we think, like, if you need to explain it away, you're the creators, you know, we've got our trust in you on all of that. And we'll be right back right after this. Hosting a summer barbecue, a backyard movie night, a slip and slide party, serving up Aperol spritzes. Whatever you're hosting, don't do it without Drizzly, your go-to app for drink delivery. With Drizzly, you can shop local stores and compare prices on beer, wine, and spirits, then get them delivered straight to your door. Boom. Hosting handled. Now, before you get back to folding napkins, download the Drizzly app or go to drizzly.com. That's D-R-I-Z-L-Y.com today. Must be 21 or over, not available in all locations. Cannot be combined with any other app or single item at regular price. Welcome back. It's Kyle Meredith with Jewel Taylor and Tony Rettenmaier. You know, when you talk about what this movie is, and it's so many different things, one of the things that is and isn't like, it's not exactly a conspiracy movie because we're in the driver's seat. We're seeing it. You know, a lot of things about when we talk about conspiracy is that's something that somebody's going off on that's probably, you know, fake. But we're seeing all this firsthand. But at the same time, it does play into that. Like, why? What makes what makes conspiracy fun to play with? Because I would think as a filmmaker that does allow you a lot to move around with if that's if that's true. I mean, I think the fun of conspiracy movies is that there's a little bit of bleed over into real life. Like, that's, I think, the difference between like a conspiracy movie and a pure mystery movie. There is we always wanted like, you know, our dream was that there were people on Reddit talking about the movie, you know, or, you know, or what the YouTube comments are about. And we're not, you know, like we're not saying that conspiracies presented in Tyrone are true, but they do they are supposed to mimic in some sense, like real world conspiracies. And I think that's that crossover between like a movie seeming like it's like tipping its hat to something in the real world is what I think makes conspiracies fun, you know, as opposed to a mystery movie where the whole question is contained within the two hours of the runtime of the movie. Yeah. And hearing you guys talk about even in other interviews, you know, it's like there the movie says a lot and it says a lot about what's going on in the world and society and race and everything. But I also hear you guys talk in a way that it's almost like you don't you don't incorrect me if I'm wrong. It almost feels like you don't want to push it too much in that because it's still entertainment. Like, you know, me and my wife are watching it, you know, of course, Tuskegee comes up in conversation, you know, and that's a real life thing. Like that happens and that feels like that's part of the underlying influence, if not maybe a direct influence. But I guess when you talk about what the message is, how much of what you all are making with this movie, you wanted a direct message versus here's entertainment, take of it what you will. I mean, I think I think the latter is completely what it is. I mean, I'm from Tuskegee, so, you know, it's obviously they're going to be people who associate, you know, syphilis experiments with the movie. It's it's clearly there if you're looking for it, you know what I'm saying? If you if you know about that, then obviously you'll see parallels. But I think we went out of our way. We really did go out of our way to try to just present it as just like something that just a bootleg Scooby Doo movie and let the chips fall. You know what I mean? It comes to how people interpret it. I think the fun is, you know, seeing people just one thing that, you know, I think we we believed in philosophically before baking it, but before you make it is kind of hard to it comes in practice. Like one thing I think is the funnest thing is really seeing how we've never been able to. We thought we would like it, but I think, you know, our hypothesis is correct. But seeing how something mutates when it's given to other people. And I mean, it goes beyond like, you know, just how people theorize and like how people interpret it. That was completely different than we were working on it. Right. Like you'll have your set of this means this, this means this, this means this. But you know that like someone going to watch it and think, you know, X doesn't equal, you know, 76 X equals 95. You know what I mean? Like they're going to have a completely different interpretation for something. And I think that's one of the funnest parts is seeing like how people interpret it. You know, what people metabolize out of it, what they don't, you know, I mean, it's, I think just seeing how other people interact with the body of work, you know, and seeing like what kind of mutations come, seeing what means come out of it, you know, to me, like seeing like, you know, I was like hoping that somebody would do a painting or something, some kind of art. And sure enough, somebody did. It was like, oh, yes, you know what I mean? And then a dude took the soundtrack and chopped and screwed it there yesterday. And it was like, yes, like, you know, people are appropriating it already, you know what I mean? Which I think is super interesting. And I think that works for like the theory crafting and the thematic takeaways as well as like, you know, people like making art on top of your art, you know what I mean? And like, I think that's been the funnest thing. So, you know, we, we didn't set out to prescribe anything to anyone, you know, I mean, it was just things that that were bothering me that conversations that me and Tony had and that we wanted to explore in the movie. I think, you know, we definitely been like pleased to see them like a lot of theories have popped up, you know, that's probably been one of the funnest part. We always like looked at it first and foremost as entertainment and then secondary, like we never saw it as a lesson plan. Like it was more like a tool that people wanted to talk about stuff, but like it wasn't, neither of us wanted to present it like we knew more than anybody watching it. And we had like some great like truth or lesson to like imprint on them. Definitely not sociologists, you know, we're not qualified to talk in a two hour movie about anything super deep, you know what I'm saying? We might be talking about things that are deep, but we're not qualified to answer anything. We can make observations. I think that's about as far as we take it. The conversations are fun afterwards, though. And again, you know, we're sitting around watching it and my wife, who's usually much smarter than me, as you'll find out as I keep quoting her, she looks at she turns over and she goes, she goes, it really makes you think about the simulation theory. And then, you know, of course, we're talking about aliens and everything else that's around at the time, you know, and I started thinking of movies like Dark City and the 13th Floor. This is all the stuff we hoped would happen, because that even goes like simulation stuff goes even outside of even the box that like Tyrone presents itself in, you know. So, yeah, I mean, that stuff's like music to our ears, you know. I got to bring up music, of course, too, since you said the word there because, well, we got 80s R&B and funk. Let's see here. I know I clocked Michael Jackson. I think there's some Bootsy Collins in there. I'm not even getting to the one at the end yet with Erika. And maybe it was one of you that said it, Jule, maybe it was you that said you tend to think in song. What were you talking about there? It's not so much that I think in music. Like, you know, I'm like singing the words necessarily. It's more of that like I think in music when I'm ideating, a lot of times I'll have a feeling and mood or tone. And it'll be a song that like encapsulates it, right? And you'll be trying to replicate how a certain song makes you feel. And this goes with almost anything, like, you know, any script that we work on. It's always a feeling that I get from music primarily that filters to feel. And so I'll be feeling a sense of melancholy from listening to James Blake. I'll be listening to retrograde and feeling very melancholic and all of a sudden melancholic ideas start to come out and then suddenly you're writing a love story. You know what I mean? That's very reductive, but you know, representation of the process. But I mean, kind of what it is in simple terms. I'll have like, you know, feelings from songs and then just images just start popping in my head. So then it's like a matter of trying to deconstruct what that means. And then we talk about it a lot and we find songs. Eventually it starts to make some semblance of sense after a while. But it's always like for me, like, how am I feeling when I hear something? Because I get like very tense feelings when I listen to different things, you know what I'm saying? So I want to feel that when I'm watching stuff, you know, like my favorite movie moments a lot of the time are like when the music and the score or needle drop and like when it synergizes and like you get that endorphin burst in the back of your neck, like that's the kind of stuff, you know, while you're watching like some shonen anime, you know what I mean? Where, you know, they really like hit you in the feels with the score, right? As you know, there's a lot of examples that you can hear in the shonen world. But I think that's really kind of where it comes from. I have a lot of nerdy things, but probably the nerdiest thing is that I collect soundtracks. I just have a wall of soundtracks and scores. You know, Tyrone soundtrack on the wall, you know? I need a sound. I need the sound. Is there a physical copy of that? We're trying to get a vinyl, you know what I'm saying? Netflix or something, you know, somebody, somebody needs to. I've got the Stranger Things vinyl. I know they can do it. Someone needs to do it, but you know. I feel like they should make like an eight track or something. That would be really cool. And we'll be right back right after this. Consequence is launching Hometowns of Consequence, a fan led initiative that celebrates America's best music venues. And we want to hear about your favorite places to see live music. Go to Consequence.net slash hometowns to nominate your favorite local venue. Check your inbox for a verification email and follow the instructions to make sure your nomination is registered. We'll announce the top 20 finalists and then decide the five winners with a fan vote later this year. To support your local venue, go to Consequence.net slash hometowns or check out the link in the show notes to get started. Consequence is launching Hometowns of Consequence, a fan led initiative that celebrates America's best music venues. And we want to hear about your favorite places to see live music. Go to Consequence.net slash hometowns to nominate your favorite local venue. Check your inbox for a verification email and follow the instructions to make sure your nomination is registered. We'll announce the top 20 finalists and then decide the five winners with a fan vote later this year. To support your local venue, go to Consequence.net slash hometowns or check out the link in the show notes to get started. Welcome back. It's Kyle Meredith with Juel Taylor and Tony Rettenmaier. Musically speaking, obviously we're in a period in this movie and there's a little things like, you know, I don't know what you call the film or the filter, you know, that the look of the film anyway, even down to, you know, when Tyrone's going through the house and he gets to the break room and there's that clock on the wall. I'm like, yeah, it's the clock on the wall from the 70s and 80s. That's that's my school clock. You know, so I mean, how did you end up in this specific period? Like, why did you all pick this specific period for the look for the music and maybe not necessarily the time though? Yeah, I mean, there was there was always this idea of being able of making the Glenn like out of space and out of time. And like for that like a big inspiration with stuff like Napoleon Dynamite or It Follows, where there seems to be these anachronism and these up in this otherwise modern world and it creates this like just a little bit of like universality to it, you know, the idea that this could be happening anywhere at any time. I think the way Dwells described it good is that like, you know, there are or it's like the cognitive dissonance that comes with like seeing a building that used to be a Pizza Hut and is now like, you know, a vet store or something. You know, it's this like, you know what it is, but now it's something different. And it's like, it's neither one or the other. I think that like little bit of disassociation or something just we wanted that in the tone of the movie. Partially for a world building and partially just for a stylistic reason. It's fun. It is funny. It just, I don't know, it feels weird. As we talk about the weird it just feels weird in the best way. You know how it all kind of comes like that. Before I forget to ask because I brought up Mindigo, but we do end with Erika Badu and it's not just Tyrone. It's a new version of Tyrone. How did you all get that to happen? A lot of people don't notice that too. And I'm still wondering how we get that, you know. They set up a meeting with Erika when we were in pre-production. So this is maybe like fall 2020, something like that. And it's like a Zoom meeting. And we were expecting to like do the whole pitch like we actually pitched the movie without a script. But we pitched Erika Badu doing the last song. So we always joked that like she was doing the song. She was there before the script was there. That's how we like to think about it. The second we was like, all right, we're really going to call it They Cloned Tyrone. That was a joke title for a long time. The second we decided to really call it They Cloned Tyrone, I was like, well, the next decision made is like, obviously Erika Badu has to remake Tyrone for us in some kind of way. And we had the Zoom meeting with Erika and we get like two minutes in and she was like, I'm in, I'm doing it. It was like, what? Like I was trying to explain that we wanted the Bernstein Bears, but she took the words out of my mouth literally. Imagine an alternate, you want me to Bernstein Bears? And I'm like, I knew this was going to be. I knew, yeah, she knew right away. And then the first like snippet that she sent me was literally like, because you know, I was like, oh, we want the live version of the song. She's like, okay, I'm gonna have to rebuild it. But I think I got you. I got you. So she remade it from scratch. Because like she didn't, she doesn't have any stems for a live recording. But the live recording is the one most people, the song for, not the album. So it's like you really need that live recording for it to feel like it's the one that we know the best. And she totally just from the first meeting, she was all the way in and really just saw Erika. She just went off and did it and just brought it back. It was like, that's exactly what I was talking about. That's amazing. And it's amazing too that you got the live because I noticed that at the beginning because, you know, she does the ladies where you at, fellas, you know. And then you're thinking like, of course, Tyrone. And then you hear those first words and you're like, wait a second. And all the response at the beginning, you know, the whole thing. I mean, that's what like she got every detail. She recreated every detail in like 2022, even though the song is 20 years old, you know what I'm saying. More than 25 years old. You know, she recreated all of these live. The crowd is recreated. The call and response, you know what I'm saying. It's like she remade it all and EQ'd it in such a way that it sounds so close to the original version. You really have to listen to them side by side to like notice the differences. That's incredible. You know, I congratulate you on the movie, but congrats on that. That's what we really take pride in. We got Erica to make Tyrone again. That's really the biggest swing that we took. We got Erica to do something like amazing. And I mean, like, Juul's like beyond just getting like convincing Erica to redo the song and stuff, like Juul is more involved in the music of this. He's modest about it, but like obviously like all directors are involved with the music, but Juul is like very intimately involved in it. And to the extent of like going in the studio and being with our composer Desmond Murray, who he used to make, who is a childhood friend that they made music since they were kids together. So, yeah, he's like historically very modest about it. And I do think it's one of the best parts of the film, you know. Well, seriously, and just another reason why we need a physical soundtrack too, so that exists. And those are fun. I mean, you know, you get in the play. I don't know if you call that an Easter egg, but it's sort of like an Easter egg because you got to pay attention. You got to find it and hearing just knowing those moments are everywhere. We also at the end of it, I was like Googling Olympia Black going, is this a real person? You know, it's like it is. It's taking everything further, you know, outside of the movie. It's exactly what I think you guys have been talking about this whole time. I haven't had that experience in a long time. We wanted to plant enough Easter eggs that people were rewarded going down those like rabbit holes, those Wikipedia rabbit holes and stuff. I hope you guys continue to do that. I mean, surely, hopefully you're talking about the next projects. And this is if this is what I can expect from you all as a team. Thank fucking God. Somebody is doing it. In the perfect world, we'll be able to in the future make more original stuff. Well, I hope so. This is one of my favorite movies I've seen a long time. So guys, thank you for what you're doing. Thank you for taking the time to talk about it. And my thanks to Joel and Tony. They cloned Tyrone on Netflix. Now, thanks to you for checking out the episode again. If you enjoyed it, I hope you hit that subscribe button. I'll give you three brand new interviews every single week, just like this one new and every Monday, Wednesday and Friday at all the spots. Spotify, Apple podcasts, you can grab us at NPR at WFPK.org, YouTube for the video versions or anywhere you get your podcasts from. You can subscribe to Kyle Meredith with. And then after that, head over to WFPK.org. That's where I do a show Monday through Friday, starting at 6 p.m. Eastern. You get the best in new music. You get lots of classic tracks. There's music news, bonus interviews. One of my recent episodes had the music of R.E.M., Elastica, The Flaming Lips, Patti Smith, Joni Mitchell, The Raconteurs, Betty Wright, Arrested Development, Pete Townsend, Heartless Bastards, Big Thief, Prince, Gabriel's, Lizzo, The Last Dinner Party, Mitzky, Pearl Jam, Jimmy Eat World, Astrid, Gilberto, Lana Del Rey, Charles Bradley, Hole, Queens of the Stone Age, Cindy Lauper, De La Soul, Fishbone and a whole lot more. That's just an example of what you get every weeknight at 6 p.m. when you tune in at WFPK.org. Consequence has your music and film news. You can also find me on any of the social media spots. The address is always the same at Kyle Meredith. So I do hope you like and follow along. That does it for another edition. I'm Kyle Meredith and I'll see you next time. The It's Always the Right Time Deal. Hey, want to go to Mickey D's for lunch? Ooh, let's go now. But it's not lunchtime yet. If we're going to McDonald's, it's always the right time. Yeah, it's hard to argue with that. There's a deal for every lunch hour at McDonald's. Now's the time we get two for $3.99. Mix and match of four-piece McNuggets, a McDouble, a McChicken or a hot and spicy McChicken. Price and participation may vary. Cannot be combined with any other offer. Single item at regular price. Consequence Podcast Network. I feel like somebody's going to make a coffee table book about backgrounds during the Zoom COVID era. It's easy to hear your favorite artist on WFPK from wherever you are. Listen on your smart speaker, live stream from our website at WFPK.org from Louisville Public Media."}, "podcast_summary": "WFPK, a radio station in Louisville, Kentucky, offers a live stream of their shows on their website. They play music from various artists, including favorites like Jamie Foxx, Teona Paris, and John Boyega. The station is known for its eclectic mix of genres, including 70s and 80s funk and pop, and occasionally features interviews with filmmakers, like Jewel Taylor and Tony Rentonmeyer, who recently worked on the Netflix film \"They Cloned Tyrone.\" The film explores themes of conspiracy, cloning, and government experiments, and features a new version of Erika Badu's song \"Tyrone.\" The filmmakers discuss their creative process, the underlying messages in the film, and the fun of world-building. They also talk about the influence of music in their work and the excitement of getting Erika Badu to collaborate on the film's soundtrack. Overall, the film offers a unique and entertaining viewing experience while touching on thought-provoking themes.", "podcast_guest": "Jewel Cianeh Taylor (née Howard; born 17 January 1963) is a Liberian politician who is currently serving as the 30th vice president of Liberia. She was married to convicted warlord and former president Charles Taylor (whom she married in 1997, but later divorced in 2006) and was First Lady of Liberia during his presidency. In 2005, Jewel Taylor was elected to the Senate of Liberia for Bong County as a member of the National Patriotic Party. She served as the Chairperson of the Senate Health and Social Welfare Committee on Gender, Women and Children.", "podcast_highlights": "In this podcast episode, host Kyle Meredith interviews filmmakers Jewel Taylor and Tony Rentonmeyer about their Netflix film \"They Cloned Tyrone.\" They discuss their experience directing their first major picture and the challenges they faced. The podcast also touches on the underlying messages of the film and how it explores conspiracies and capers. The filmmakers talk about their process of world-building and creating specific character traits for the clones. They also discuss the music of the film, which features 70s and 80s funk and pop, and the exciting collaboration with Erykah Badu to rerecord her classic track \"Tyrone.\" Overall, the podcast provides insights into the making of the film and the ideas explored within it."}